; domain
(define (domain parking)
 (:requirements :strips :typing :action-costs)
 (:types car curb)
 (:predicates 
    (at-curb ?car - car) 
    (at-curb-num ?car - car ?curb - curb)
    (behind-car ?car ?front-car - car)
    (car-clear ?car - car) 
    (curb-clear ?curb - curb)
 )

(:functions (total-cost) - number)

	(:action move-curb-to-curb
		:parameters (?car - car ?curbsrc ?curbdest - curb)
		:precondition (and 
			(car-clear ?car)
			(curb-clear ?curbdest)
			(at-curb-num ?car ?curbsrc)
		)
		:effect (and 
			(not (curb-clear ?curbdest))
			(curb-clear ?curbsrc)
			(at-curb-num ?car ?curbdest)
			(not (at-curb-num ?car ?curbsrc))
                        (increase (total-cost) 1)
		)
	)

	(:action move-curb-to-car
		:parameters (?car - car ?curbsrc - curb ?cardest - car)
		:precondition (and 
			(car-clear ?car)
			(car-clear ?cardest)
			(at-curb-num ?car ?curbsrc)
			(at-curb ?cardest) 
		)
		:effect (and 
			(not (car-clear ?cardest))
			(curb-clear ?curbsrc)
			(behind-car ?car ?cardest)
			(not (at-curb-num ?car ?curbsrc))
			(not (at-curb ?car))
                        (increase (total-cost) 1)
		)
	)

	(:action move-car-to-curb
		:parameters (?car - car ?carsrc - car ?curbdest - curb)
		:precondition (and 
			(car-clear ?car)
			(curb-clear ?curbdest)
			(behind-car ?car ?carsrc)
		)
		:effect (and 
			(not (curb-clear ?curbdest))
			(car-clear ?carsrc)
			(at-curb-num ?car ?curbdest)
			(not (behind-car ?car ?carsrc))
			(at-curb ?car)
                        (increase (total-cost) 1)
		)
	)

	(:action move-car-to-car
		:parameters (?car - car ?carsrc - car ?cardest - car)
		:precondition (and 
			(car-clear ?car)
			(car-clear ?cardest)
			(behind-car ?car ?carsrc)
			(at-curb ?cardest) 
		)
		:effect (and 
			(not (car-clear ?cardest))
			(car-clear ?carsrc)
			(behind-car ?car ?cardest)
			(not (behind-car ?car ?carsrc))
                        (increase (total-cost) 1)
		)
	)
)

; problem
(define   (problem parking)
  (:domain parking)
  (:objects
     car_0  car_1  car_2  car_3  car_4  car_5  car_6  car_7  car_8 - car
     curb_0 curb_1 curb_2 curb_3 curb_4 curb_5 - curb
  )
  (:init
    (at-curb car_1)
    (at-curb-num car_1 curb_0)
    (behind-car car_6 car_1)
    (car-clear car_6)
    (at-curb car_7)
    (at-curb-num car_7 curb_1)
    (behind-car car_4 car_7)
    (car-clear car_4)
    (at-curb car_0)
    (at-curb-num car_0 curb_2)
    (behind-car car_8 car_0)
    (car-clear car_8)
    (at-curb car_5)
    (at-curb-num car_5 curb_3)
    (car-clear car_5)
    (at-curb car_2)
    (at-curb-num car_2 curb_4)
    (car-clear car_2)
    (at-curb car_3)
    (at-curb-num car_3 curb_5)
    (car-clear car_3)
  )
  (:goal
    (and
      (at-curb-num car_0 curb_0)
      (behind-car car_6 car_0)
      (at-curb-num car_1 curb_1)
      (behind-car car_7 car_1)
      (at-curb-num car_2 curb_2)
      (behind-car car_8 car_2)
      (at-curb-num car_3 curb_3)
      (at-curb-num car_4 curb_4)
      (at-curb-num car_5 curb_5)
    )
  )
)
; =========== INIT =========== 
;  curb_0: car_1 car_6 
;  curb_1: car_7 car_4 
;  curb_2: car_0 car_8 
;  curb_3: car_5 
;  curb_4: car_2 
;  curb_5: car_3 
; ========== /INIT =========== 

; =========== GOAL =========== 
;  curb_0: car_0 car_6 
;  curb_1: car_1 car_7 
;  curb_2: car_2 car_8 
;  curb_3: car_3 
;  curb_4: car_4 
;  curb_5: car_5 
; =========== /GOAL ===========

; plan
1. (move-curb-to-car car_3 curb_5 car_2)
   deleted: (car-clear car_2) (at-curb-num car_3 curb_5) (at-curb car_3)
   added: (curb-clear curb_5) (behind-car car_3 car_2)
   goals met: 0 of 9
2. (move-curb-to-curb car_5 curb_3 curb_5)
   deleted: (curb-clear curb_5) (at-curb-num car_5 curb_3)
   added: (curb-clear curb_3) (at-curb-num car_5 curb_5)
   goals met: 1 of 9
3. (move-car-to-curb car_3 car_2 curb_3)
   deleted: (curb-clear curb_3) (behind-car car_3 car_2)
   added: (car-clear car_2) (at-curb-num car_3 curb_3) (at-curb car_3)
   goals met: 2 of 9
4. (move-car-to-car car_8 car_0 car_5)
   deleted: (car-clear car_5) (behind-car car_8 car_0)
   added: (car-clear car_0) (behind-car car_8 car_5)
   goals met: 2 of 9
5. (move-car-to-car car_4 car_7 car_3)
   deleted: (car-clear car_3) (behind-car car_4 car_7)
   added: (car-clear car_7) (behind-car car_4 car_3)
   goals met: 2 of 9
6. (move-curb-to-car car_7 curb_1 car_0)
   deleted: (car-clear car_0) (at-curb-num car_7 curb_1) (at-curb car_7)
   added: (curb-clear curb_1) (behind-car car_7 car_0)
   goals met: 2 of 9
7. (move-car-to-car car_6 car_1 car_2)
   deleted: (car-clear car_2) (behind-car car_6 car_1)
   added: (car-clear car_1) (behind-car car_6 car_2)
   goals met: 2 of 9
8. (move-curb-to-curb car_1 curb_0 curb_1)
   deleted: (curb-clear curb_1) (at-curb-num car_1 curb_0)
   added: (curb-clear curb_0) (at-curb-num car_1 curb_1)
   goals met: 3 of 9
9. (move-car-to-car car_7 car_0 car_1)
   deleted: (car-clear car_1) (behind-car car_7 car_0)
   added: (car-clear car_0) (behind-car car_7 car_1)
   goals met: 4 of 9
10. (move-curb-to-curb car_0 curb_2 curb_0)
   deleted: (curb-clear curb_0) (at-curb-num car_0 curb_2)
   added: (curb-clear curb_2) (at-curb-num car_0 curb_0)
   goals met: 5 of 9
11. (move-car-to-car car_6 car_2 car_0)
   deleted: (car-clear car_0) (behind-car car_6 car_2)
   added: (car-clear car_2) (behind-car car_6 car_0)
   goals met: 6 of 9
12. (move-curb-to-curb car_2 curb_4 curb_2)
   deleted: (curb-clear curb_2) (at-curb-num car_2 curb_4)
   added: (curb-clear curb_4) (at-curb-num car_2 curb_2)
   goals met: 7 of 9
13. (move-car-to-car car_8 car_5 car_2)
   deleted: (car-clear car_2) (behind-car car_8 car_5)
   added: (car-clear car_5) (behind-car car_8 car_2)
   goals met: 8 of 9
14. (move-car-to-curb car_4 car_3 curb_4)
   deleted: (curb-clear curb_4) (behind-car car_4 car_3)
   added: (car-clear car_3) (at-curb-num car_4 curb_4) (at-curb car_4)
   goals met: 9 of 9
